Mise a jour du readme avec ajout de la V1 + image et correction des diagramme + ajout de la V2 avec diag mais en attente de rediscussion
