--- a/Readme.md
+++ b/Readme.md
@@ -86,78 +94,91 @@ user --> UC7
 
+A l'aide du pattern que nous avons choisi, nous avons pu réaliser le diagramme de classe suivant:
 
+```plantuml
+@startuml
 
-```mermaid
-classDiagram
-direction BT
-class Command {
-<<Interface>>
-  + execute() void
+!theme plain
+top to bottom direction
+skinparam linetype ortho
+
+interface Command << interface >> {
+  + execute(): void
 }
 class CopyCommand {
-  + getInstance(Editor) CopyCommand
-  + execute() void
+  + execute(): void
+  + getInstance(Editor): CopyCommand
 }
 class CutCommand {
-  + execute() void
-  + getInstance(Editor) CutCommand
+  + execute(): void
+  + getInstance(Editor): CutCommand
 }
 class Editor {
-   String selectedTextText
-   String copyBuffer
-   JTextArea textArea
+  - textArea: JTextArea
+  - copyBuffer: String
+   selectedTextText: String
+   copyBuffer: String
+   textArea: JTextArea
 }
 class JButton {
-  # paramString() String
-  + updateUI() void
-  + removeNotify() void
-  - writeObject(ObjectOutputStream) void
-   String UIClassID
-   AccessibleContext accessibleContext
-   boolean defaultButton
-   boolean defaultCapable
+  + removeNotify(): void
+  + updateUI(): void
+  - writeObject(ObjectOutputStream): void
+  # paramString(): String
+   UIClassID: String
+   accessibleContext: AccessibleContext
+   defaultButton: boolean
+   defaultCapable: boolean
 }
 class MainEditor {
-  + main(String[]) void
+  + main(String[]): void
 }
 class PasteCommand {
-  + getInstance(Editor) PasteCommand
-  + execute() void
+  + getInstance(Editor): PasteCommand
+  + execute(): void
 }
 class SelectLeftCommand {
-  + execute() void
-  + getInstance(Editor) SelectLeftCommand
+  + execute(): void
+  + getInstance(Editor): SelectLeftCommand
 }
 class SelectRightCommand {
-  + execute() void
-  + getInstance(Editor) SelectRightCommand
+  + getInstance(Editor): SelectRightCommand
+  + execute(): void
 }
 
-CopyCommand  ..>  Command 
-CopyCommand "1" *--> "editor 1" Editor 
-CutCommand  ..>  Command 
-CutCommand "1" *--> "editor 1" Editor 
-Editor  ..>  JButton : «create»
-MainEditor  ..>  Editor : «create»
-PasteCommand  ..>  Command 
-PasteCommand "1" *--> "editor 1" Editor 
-SelectLeftCommand  ..>  Command 
-SelectLeftCommand "1" *--> "editor 1" Editor 
-SelectRightCommand  ..>  Command 
-SelectRightCommand "1" *--> "editor 1" Editor 
+CopyCommand         -[#008200,dashed]-^  Command  
+CopyCommand        "1" *-[#595959,plain]->  Editor   
+CutCommand          -[#008200,dashed]-^  Command  
+CutCommand         "1" *-[#595959,plain]->  Editor   
+Editor              -[#595959,dashed]->  JButton            : "«create»"
+MainEditor          -[#595959,dashed]->  Editor             : "«create»"
+PasteCommand        -[#008200,dashed]-^  Command  
+PasteCommand       "1" *-[#595959,plain]->  Editor   
+SelectLeftCommand   -[#008200,dashed]-^  Command  
+SelectLeftCommand  "1" *-[#595959,plain]->  Editor   
+SelectRightCommand  -[#008200,dashed]-^  Command  
+SelectRightCommand "1" *-[#595959,plain]->  Editor   
+@enduml
 ```
-Nous avons décidé de créer unn classe Editor avec le framework Swing qui donnera à l'utilisateur un accès à une zone de texte (JTextArea) 
-ainsi qu'à un ensemble de bouton executant les actions voulus par l'utilisateur.
 
